{"https://www.depts.ttu.edu/k12/about/": "About | Texas Tech K-12  | TTU Texas Tech University Directory Raiderlink A-Z Index TTU K-12 Menu Search TTU Texas Tech K-12 About About Texas Tech K-12 Texas Tech K-12, a division of Texas Tech University Online, has been offering state-approved\n                                 online education for kindergarten through 12th grade students for over 30 years. Texas\n                                 Tech K-12 is a Carnegie tier-one research institution, we provide a rigorous and flexible\n                                 curriculum that empowers students to work at their own pace, recover credits and achieve\n                                 their academic goals from anywhere. Our Mission and Impact Founded in 1993 as a \"Special Purpose District,\" Texas Tech K-12 was designed for\n                        students whose educational requirements were not being met by traditional school systems.\n                        Over the years, we have grown to support students across the United States and in\n                        more than 70 countries worldwide. We are proud to help students graduate on time,\n                        make up missed credits, take courses unavailable at other schools and supplement their\n                        education in a way that fits their individual needs. Who We Serve Our Programs We serve a wide range of students, including: Texas Tech K-12 offers flexible educational solutions, including: Professional students Military families Families who travel frequently Non-traditional students Students living overseas Homeschoolers Adults finishing high school Hospital/homebound students Students struggling academically or socially Students not served by traditional schools Full-time Texas high school diploma programs (tuition-free and paid options) Individual courses and summer school Dual credit and AP courses Credit by exams (CBEs) Open-enrollment testing solutions Adult education programs (GED, high school diploma) Accreditation and Quality Assurance Texas Tech K-12 is recognized nationally and internationally for meeting Cognia Standards\n                        of Quality. Accredited by Cognia, a nonprofit organization that provides quality assurance\n                        for educational institutions, this accreditation reflects our commitment to academic\n                        excellence, effective leadership, and equitable resource allocation. We are also approved by the Texas Education Agency (TEA), ensuring our courses meet\n                        Texas state requirements, including preparation for the State of Texas Assessments\n                        of Academic Readiness (STAAR) and End of Course (EOC) exams. Students also can participate in a graduation ceremony at the Texas Tech University\n                        campus. Our high school courses are NCAA-approved, ensuring that college-bound student-athletes\n                        are prepared for academic expectations. A Commitment to Inclusivity and Equality Texas Tech K-12 adheres to Title IX regulations, prohibiting discrimination based\n                        on sex, gender identity, sexual orientation, national origin, religion, disability,\n                        or protected veteran status. We are committed to creating an inclusive environment\n                        where all students can thrive. Why Choose Texas Tech K-12? Accredited & Approved: We meet the highest standards for quality education and are recognized for our commitment\n                        to student success. Flexible Learning: Students can start at any time and work at their own pace to balance academic goals\n                        with other activities. Supportive Community: Texas-certified teachers and a dedicated support team provide personalized assistance\n                        to help students succeed. Contact Us If you have questions or would like more information, our advisers and staff are available\n                           to assist you. Toll-Free: (800) 692-6877 Local: (806) 464-4173 Email: ttuk12@ttu.edu We invite you to learn more about Texas Tech K-12, read student stories , and discover how we can help you achieve your educational goals. Request More Information TTU K-12 Like TTU K-12 on Facebook Like TTU K-12 on Facebook Subscribe to TTU K-12 on YouTube Subscribe to TTU K-12 on YouTube Follow TTU K-12 on Instagram Follow TTU K-12 on Instagram Address Texas Tech Plaza | 1901 University Ave, Lubbock, TX 79401 Phone (800) 692-6877 Email ttuk12@ttu.edu Texas Tech University 2500 Broadway Lubbock, Texas 79409 806.742.2011 Follow Texas Tech University Like Texas Tech University on Facebook Like Texas Tech University on Facebook Follow Texas Tech University on X (twitter) Follow Texas Tech University on X (twitter) Subscribe to Texas Tech University on YouTube Subscribe to Texas Tech University on YouTube Follow Texas Tech University on Instagram Follow Texas Tech University on Instagram Connect with Texas Tech University on LinkedIn Connect with Texas Tech University on LinkedIn Contact Us Campus Map Jobs @ TTU TechAlert General Policy Information Public Access to Course Info Energy Management Mental Health Resources Title IX Fraud and Misconduct Hotline Online Institutional Resumes Texas Transparency TTU System TTU Health Sciences Center TTUHSC El Paso Angelo State University Midwestern State University Statewide Search State of Texas Texas Homeland Security Texas Veterans Portal Texas CREWS SAO Fraud Reporting Open Records Requests © 2025            \t\t\t\t\t Texas Tech University Jan 31, 2025 10:29 AM TTU K-12 About TTU K-12 About Back About Us Meet Our Team Advisory Board FAQs Contact Us (Phone, Email) Programs TTU K-12 Programs Back K-12 Programs TTU K-12 Programs K-12 Programs Back Overview Tuition-Free Tuition-Paid Grade Levels (Elementary, Middle, High School) Supplemental Courses TTU K-12 Programs Supplemental Courses Back Single Course Enrollment Dual Credit Specialized Programs TTU K-12 Programs Specialized Programs Back Credit By Exams (CBEs) District Solutions TTU K-12 Programs District Solutions Back Solutions for Schools & Districts International Partnerships TTU K-12 Programs International Partnerships Back Texas Tech K-12 International Partnerships Adult Education TTU K-12 Programs Adult Education Back TWC  Adult Education Program Admissions TTU K-12 Admissions Back Enroll Tuition & Fees Course Catalog Student Resources TTU K-12 Student Resources Back Academic & Testing Resources TTU K-12 Student Resources Academic & Testing Resources Back Parent & Student Handbook Testing Resources Proctor Information Course Descriptions & Syllabi Student Support & Services TTU K-12 Student Resources Student Support & Services Back Military Support Disabilities Graduation & Financial Support TTU K-12 Student Resources Graduation & Financial Support Back Graduation & Scholarship Information Student Life & Engagement TTU K-12 Student Resources Student Life & Engagement Back Student Organizations Bookstore Experiential Learning TTU K-12 Student Resources Experiential Learning Back iOS Design Lab News & Updates TTU K-12 News & Updates Back Newsletter & Stories Contact Focus Login Additional Resources TTU Home Directory Raiderlink A-Z Index", "https://www.depts.ttu.edu/k12/about/staff/": "Faculty & Staff | About | Texas Tech K-12  | TTU Texas Tech University Directory Raiderlink A-Z Index TTU K-12 Menu Search TTU Texas Tech K-12 About Faculty & Staff Faculty & Staff at Texas Tech K-12 Administration Brian Still, Ph.D. Vice Provost Brian Still, professor of technical communication, was officially appointed by the\n                              Office of the Provost as Vice Provost for eLearning & Academic Partnerships, effective\n                              Jan. 2, 2023, after serving as Interim Vice Provost since June of 2022. More » Cari Moye, Ph.D. Acting Superintendent Cari Moye is the principal of TTU K-12. After graduating from Texas Tech and Wayland Baptist University, she taught kindergarten,\n                              second and fourth grade. More » Braxton Allison, M.A. Principal of Instruction Braxton Allison received his bachelor's degree from Lubbock Christian University in\n                              2010, and he has spent nine years in education. More » Kelly Brownfield, M. Ed. Assistant Principal Hello, my name is Kelly Brownfield. I have bachelor’s degrees from the University\n                              of Arizona and the University of South Florida. I love teaching and building relationships\n                              with students, parents, and staff. I am excited to be a part of the TTU K-12 team\n                              and look forward to serving you! More » Rhonda Coursey, M.Ed. Assistant Principal Rhonda Coursey is an assistant principal for TTU K-12. She graduated from Texas Tech\n                              University with her bachelor's degree and then obtained her Texas teacher certificate\n                              from West Texas A&M University. She loves the academic solutions and opportunities\n                              virtual learning provides and is proud to serve alongside the passionate and forward-thinking\n                              team at TTU K-12. More » Rachel Draper, MBA Assistant Principal Hello, my name is Rachel Draper. It is an honor to be working for Texas Tech in the\n                              online K-12 program. Currently, I am directing the adult learning program which allows\n                              students who made the decision to drop out of school to return to complete their dream\n                              of obtaining a GED or a traditional high school diploma. I have served in my areas\n                              of education including as a special education teacher, alternative education teacher\n                              and a middle school administrator. My heart is always to accept students where they\n                              are and help them go to where they need to be. Outside of this work, I am a mom, grandmother\n                              and foster mom. I spend my time outside of work focused on the children in my life\n                              and my husband. I am looking forward to helping you reach your goals. More » Keetha Chadwick Assistant Principal Keetha Chadwick is an assistant principal for Texas Tech K-12. She graduated from\n                              Texas A&M University with her bachelor's degree in education and then obtained her\n                              master's degree in educational leadership from Stephen F. Austin University. In her\n                              20-year career she has served as a classroom teacher, interventionist and as an assistant\n                              principal. She is thrilled to bring her experience and passion for education to the\n                              Texas Tech K-12 students as well as to the adult learners in the adult learning program. More » Support Staff for All Students Teachers TTU K-12 Like TTU K-12 on Facebook Like TTU K-12 on Facebook Subscribe to TTU K-12 on YouTube Subscribe to TTU K-12 on YouTube Follow TTU K-12 on Instagram Follow TTU K-12 on Instagram Address Texas Tech Plaza | 1901 University Ave, Lubbock, TX 79401 Phone (800) 692-6877 Email ttuk12@ttu.edu Texas Tech University 2500 Broadway Lubbock, Texas 79409 806.742.2011 Follow Texas Tech University Like Texas Tech University on Facebook Like Texas Tech University on Facebook Follow Texas Tech University on X (twitter) Follow Texas Tech University on X (twitter) Subscribe to Texas Tech University on YouTube Subscribe to Texas Tech University on YouTube Follow Texas Tech University on Instagram Follow Texas Tech University on Instagram Connect with Texas Tech University on LinkedIn Connect with Texas Tech University on LinkedIn Contact Us Campus Map Jobs @ TTU TechAlert General Policy Information Public Access to Course Info Energy Management Mental Health Resources Title IX Fraud and Misconduct Hotline Online Institutional Resumes Texas Transparency TTU System TTU Health Sciences Center TTUHSC El Paso Angelo State University Midwestern State University Statewide Search State of Texas Texas Homeland Security Texas Veterans Portal Texas CREWS SAO Fraud Reporting Open Records Requests © 2025            \t\t\t\t\t Texas Tech University Oct 29, 2024 2:31 PM TTU K-12 About TTU K-12 About Back About Us Meet Our Team Advisory Board FAQs Contact Us (Phone, Email) Programs TTU K-12 Programs Back K-12 Programs TTU K-12 Programs K-12 Programs Back Overview Tuition-Free Tuition-Paid Grade Levels (Elementary, Middle, High School) Supplemental Courses TTU K-12 Programs Supplemental Courses Back Single Course Enrollment Dual Credit Specialized Programs TTU K-12 Programs Specialized Programs Back Credit By Exams (CBEs) District Solutions TTU K-12 Programs District Solutions Back Solutions for Schools & Districts International Partnerships TTU K-12 Programs International Partnerships Back Texas Tech K-12 International Partnerships Adult Education TTU K-12 Programs Adult Education Back TWC  Adult Education Program Admissions TTU K-12 Admissions Back Enroll Tuition & Fees Course Catalog Student Resources TTU K-12 Student Resources Back Academic & Testing Resources TTU K-12 Student Resources Academic & Testing Resources Back Parent & Student Handbook Testing Resources Proctor Information Course Descriptions & Syllabi Student Support & Services TTU K-12 Student Resources Student Support & Services Back Military Support Disabilities Graduation & Financial Support TTU K-12 Student Resources Graduation & Financial Support Back Graduation & Scholarship Information Student Life & Engagement TTU K-12 Student Resources Student Life & Engagement Back Student Organizations Bookstore Experiential Learning TTU K-12 Student Resources Experiential Learning Back iOS Design Lab News & Updates TTU K-12 News & Updates Back Newsletter & Stories Contact Focus Login Additional Resources TTU Home Directory Raiderlink A-Z Index", "https://www.depts.ttu.edu/k12/advisory-board/": "Advisory Board | Texas Tech K-12  | TTU Texas Tech University Directory Raiderlink A-Z Index TTU K-12 Menu Search TTU Texas Tech K-12 TTU K-12 Advisory Board Texas Tech K-12 Advisory Board The State Board of Education (SBOE) adopted Texas Administrative Code §61 Subchapter\n                              B: Special Purpose School Districts in October 2020. Among the requirements of this\n                              statute is the creation of an Advisory Board for Texas Tech K-12. The statute specifically mentions the Advisory Board as follows: (d) Each special purpose school district shall have an advisory board consisting of at least five members that, along with the superintendent, reports\n                                 to the board of regents regarding the operation of the district. The president of\n                                 the university may designate a person to report on the management, operations, and\n                                 accountability of the special purpose school district to the board of regents. The\n                                 following requirements apply to each special purpose school district. (1) The advisory board shall hold public meetings that comply with appropriate notice requirements for governmental\n                                 bodies. (2) The president of the university shall appoint the superintendent of the special\n                                 purpose school district. (3) The university shall submit nominees for approval by the State Board of Education\n                                 (SBOE) to serve as special purpose school district advisory board members. The superintendent may not participate in the nomination process for the advisory board . (4) The superintendent and advisory board shall ensure information required to be made available to the public is made available\n                                 on the special purpose school district's website. (5) The university shall develop an advisory board training program that provides the relevant board training required under Texas Education\n                                 Code (TEC), §11.159, and shall submit to the SBOE the training requirements by September\n                                 1 of each odd-numbered year. (i) As a special purpose school district is designed to provide education statewide\n                                 through digital learning methodologies, the following special requirements and modifications\n                                 are in effect. (11) The requirements of TEC, §28.004, to have a school health advisory council do\n                                 not apply, but the special purpose school district shall: (A) comply with the provisions of TEC, §28.004, with regard to the parameters of health\n                                 education and curriculum materials; posting, notice, and grievance provisions; and\n                                 consideration of related issues; and (B) require that the advisory board solicit community and parental input and develop recommendations regarding the subject\n                                 matter of TEC, §28.004(c)(1), (2)(A) and (D)-(H), and (3)-(6). (m) The parent university of each special purpose school district shall submit nominations\n                                 for and establish an advisory board as soon as practicable, and the provisions of this section that require the special\n                                 purpose school district to develop a policy apply beginning with the 2021-2022 school\n                                 year. Advisory Board Meetings Texas Tech K-12 Advisory Board meetings are open to the public and can be accessed\n                              below. February 12, 2024 Meeting Zoom Stream Link Advisory Board Agenda November 13, 2023 Meeting Zoom Stream Link Advisory Board Agenda April 3, 2023 Meeting Zoom Stream Link Advisory Board Agenda November 8, 2022 Meeting Zoom Stream Link Advisory Board Agenda Advisory Board Minutes June 16, 2022 Meeting Recording Advisory Board Agenda Meeting Materials: TEA Allotment & TEKS Certification Form 2022-2023 TTU K-12 Academic Calender 2021-2022 Texas Tech K-12 CTE Programs of Study and Course Offerings 2022-2023 November 5, 2021 Meeting Recording Advisory Board Agenda Advisory Board Minutes Meeting Materials: Meeting Presentation Digital Learning Accreditation Engagement Review Report District Improvement Plan July 19, 2021 Meeting Recording Advisory Board Agenda & Meeting Materials Meeting Presentation Board Information Advisory Board Membership District Improvement Plan 2021-2022 , approved by Advisory Board 11.5.2021 Campus Improvement Plan 2021-2022 , approved by Advisory Board 11.5.2021 Public Comment Submit a Public Comment for the Next Meeting All persons requesting to address the Advisory Board regarding an item on this agenda\n                                    should do so in writing at least 24 hours before the start of the meeting using this form . A toll-free telephone number, free-of-charge video conference link, or other means\n                                    will be provided by which to do so. Individuals who may require auxiliary aids or\n                                    services for this meeting should contact Mr. Cary Sallee at cary.sallee@ttu.edu at least five days before the meeting so that appropriate arrangements can be made. TTU K-12 Like TTU K-12 on Facebook Like TTU K-12 on Facebook Subscribe to TTU K-12 on YouTube Subscribe to TTU K-12 on YouTube Follow TTU K-12 on Instagram Follow TTU K-12 on Instagram Address Texas Tech Plaza | 1901 University Ave, Lubbock, TX 79401 Phone (800) 692-6877 Email ttuk12@ttu.edu Texas Tech University 2500 Broadway Lubbock, Texas 79409 806.742.2011 Follow Texas Tech University Like Texas Tech University on Facebook Like Texas Tech University on Facebook Follow Texas Tech University on X (twitter) Follow Texas Tech University on X (twitter) Subscribe to Texas Tech University on YouTube Subscribe to Texas Tech University on YouTube Follow Texas Tech University on Instagram Follow Texas Tech University on Instagram Connect with Texas Tech University on LinkedIn Connect with Texas Tech University on LinkedIn Contact Us Campus Map Jobs @ TTU TechAlert General Policy Information Public Access to Course Info Energy Management Mental Health Resources Title IX Fraud and Misconduct Hotline Online Institutional Resumes Texas Transparency TTU System TTU Health Sciences Center TTUHSC El Paso Angelo State University Midwestern State University Statewide Search State of Texas Texas Homeland Security Texas Veterans Portal Texas CREWS SAO Fraud Reporting Open Records Requests © 2025            \t\t\t\t\t Texas Tech University Nov 19, 2024 7:28 AM TTU K-12 About TTU K-12 About Back About Us Meet Our Team Advisory Board FAQs Contact Us (Phone, Email) Programs TTU K-12 Programs Back K-12 Programs TTU K-12 Programs K-12 Programs Back Overview Tuition-Free Tuition-Paid Grade Levels (Elementary, Middle, High School) Supplemental Courses TTU K-12 Programs Supplemental Courses Back Single Course Enrollment Dual Credit Specialized Programs TTU K-12 Programs Specialized Programs Back Credit By Exams (CBEs) District Solutions TTU K-12 Programs District Solutions Back Solutions for Schools & Districts International Partnerships TTU K-12 Programs International Partnerships Back Texas Tech K-12 International Partnerships Adult Education TTU K-12 Programs Adult Education Back TWC  Adult Education Program Admissions TTU K-12 Admissions Back Enroll Tuition & Fees Course Catalog Student Resources TTU K-12 Student Resources Back Academic & Testing Resources TTU K-12 Student Resources Academic & Testing Resources Back Parent & Student Handbook Testing Resources Proctor Information Course Descriptions & Syllabi Student Support & Services TTU K-12 Student Resources Student Support & Services Back Military Support Disabilities Graduation & Financial Support TTU K-12 Student Resources Graduation & Financial Support Back Graduation & Scholarship Information Student Life & Engagement TTU K-12 Student Resources Student Life & Engagement Back Student Organizations Bookstore Experiential Learning TTU K-12 Student Resources Experiential Learning Back iOS Design Lab News & Updates TTU K-12 News & Updates Back Newsletter & Stories Contact Focus Login Additional Resources TTU Home Directory Raiderlink A-Z Index", "https://www.depts.ttu.edu/k12/faq/": "FAQ | Texas Tech K-12  | TTU Texas Tech University Directory Raiderlink A-Z Index TTU K-12 Menu Search TTU Texas Tech K-12 FAQ's Texas Tech K-12 Frequently Asked Questions Texas Tech K-12 Parents and Students Tuition-Free Program for Parents Full-Time Tuition-Paid Program Adult Education Texas Tech K-12 Parents and Students What is Texas Tech K-12? Texas Tech K-12 is a state-approved online school affiliated with Texas Tech University,\n                                 offering a rigorous and flexible curriculum for students in kindergarten through 12th\n                                 grade. Our programs allow students to complete their education at their own pace while\n                                 meeting state academic requirements. Who is eligible to enroll in Texas Tech K-12? Texas Tech K-12 serves a diverse range of students, including: Professional students Military families Students who travel frequently Homeschoolers Adults completing high school Hospitalized or homebound students Students struggling academically or socially Students in need of credit recovery What programs does Texas Tech K-12 offer? We offer a variety of programs, including: Full-time diploma programs (tuition-free and tuition-paid options) Individual courses Dual credit and Advanced Placement (AP) courses Credit by Exams (CBEs) Summer school options Open-enrollment testing solutions Adult education programs (GED and high school diploma) How do I enroll in Texas Tech K-12? Enrollment is easy and flexible. You can apply online, and our team will guide you\n                                 through the process. Whether you are enrolling for full-time education or individual\n                                 courses, we can assist you with the right program for your needs. Visit our enrollment page to get started. Is Texas Tech K-12 accredited? Yes! Texas Tech K-12 is accredited by Cognia, which ensures that we meet high standards\n                                 for academic quality, leadership and resource allocation. Additionally, we are approved\n                                 by the Texas Education Agency (TEA), which means our courses meet state requirements\n                                 for graduation. Can I earn a Texas High School Diploma through Texas Tech K-12? Yes, you can earn a full Texas High School Diploma through our tuition-free and paid\n                                 full-time programs. Upon successful completion of the program, students are invited\n                                 to participate in a graduation ceremony on the Texas Tech University campus. Are the courses NCAA-approved? Yes, our high school courses are approved by the National Collegiate Athletic Association\n                                 (NCAA). This ensures that college-bound student-athletes can meet the academic requirements\n                                 to compete in college sports. How flexible is the Texas Tech K-12 curriculum? Our curriculum is designed to be flexible and self-paced. Students can start at any\n                                 time and adjust their schedule to fit their individual needs. This flexibility makes\n                                 it ideal for students involved in extracurricular activities, those who need to recover\n                                 credits, or families who travel frequently. How do I get support while enrolled? Texas Tech K-12 provides robust support for students, parents and guardians. Our team\n                                 of Texas-certified teachers is available to assist students, and our 24/7 student\n                                 services portal offers online chat, phone assistance, and email support. How can I contact Texas Tech K-12 for help? You can reach our support team at: Toll-Free: (800) 692-6877 Local: (806) 464-4173 Email: ttuk12@ttu.edu What are the benefits of enrolling in Texas Tech K-12? Accreditation & Quality: Our programs are accredited and approved by Cognia and the Texas Education Agency,\n                                    ensuring a quality education. Flexible Learning: Students can work at their own pace and adjust schedules to fit their lifestyles. Supportive Environment: Our team of dedicated, Texas-certified teachers offers personalized support to help\n                                    students succeed. Variety of Programs: We provide options for full-time diplomas, individual courses, and adult education,\n                                    all designed to meet students’ needs. What is the graduation process for Texas Tech K-12? Students who complete the full-time diploma program will receive a Texas High School\n                                 Diploma. Upon completion, they are invited to attend a graduation ceremony on the\n                                 Texas Tech University campus, celebrating their academic achievement. Can my child take AP or dual-credit courses? Yes, we offer both Advanced Placement (AP) courses and dual-credit courses, allowing\n                                 high school students to earn college credit while completing their high school education. Is there a cost for attending Texas Tech K-12? Texas Tech K-12 offers both tuition-free and paid tuition options for full-time programs.\n                                 Costs for individual courses and dual-credit programs may vary. Please contact us for more detailed pricing information. What technology is required for Texas Tech K-12? Students will need a reliable internet connection, a computer or tablet and basic\n                                 software for online learning. We use innovative online technologies to deliver a seamless\n                                 learning experience. How do I track my child's progress? Parents can monitor their child's progress through our online platform. You will have\n                                 access to grades, assignments, and reports to ensure your child is on track. Are there special programs for military families? Yes! Texas Tech K-12 is designated as a Purple Star Campus by the Texas Education\n                                 Agency, recognizing our commitment to supporting military-connected students and their\n                                 families. What is Title IX, and how does it relate to Texas Tech K-12? Title IX is a federal law that prohibits discrimination based on sex in educational\n                                 programs. Texas Tech K-12 adheres to Title IX regulations, ensuring all students have\n                                 equal access to education, regardless of sex, gender identity or other protected statuses. Tuition-Free Program FAQ for Parents Who is eligible for the tuition-free program? Any full-time K-12 student who is a Texas resident. What do I need to apply? The program must meet your child’s academic needs. Your child needs a computer with the required specs and reliable internet. Submit a birth certificate and proof of Texas residency. Your child must have achieved satisfactory performance on the STAAR assessments. How is attendance tracked in an online school? Attendance is based on progress in your child’s courses. Your child must complete 5% of each course's assignments each week. For example, if\n                                    a course has 20 assignments, at least one should be completed each week. Each semester-long course must be completed in six months. Students must stay enrolled in at least four courses. How do I apply? New students enter a lottery every six months (fall for the new school year and January\n                                    for mid-year transfers). If not selected, you’ll be placed on a waitlist and notified if a spot opens. What if my child is not selected in the lottery? You’ll be placed on a waitlist. If a spot opens, you’ll be contacted via email or\n                                 phone. You can also try again in the next lottery. Does my child need to take state tests? Yes, students must take the STAAR and End-of-Course exams as required by state law. How long do I have to complete a course? You have six months to finish each course. Can I get an extension if I can’t finish a course in time? No, extensions are not allowed. Can my child take the summer off? Yes, if they are on track, you can request “vacation” days anytime during the year. When does the school year start? Students can enroll and start any time during the year. They’ll have six months to\n                                 complete their courses from when they begin. What if my child doesn’t complete a course in six months? If your child fails to meet progress requirements, they may be removed from the program. What if I have other children interested in this program? Siblings of a selected student may get priority in the lottery if space allows. Can my child finish a course faster if they want? The shortest time to complete a course is 30 days. Can students with IEPs or 504 plans enroll? Yes, if the online program is appropriate for their needs. The ARD or 504 committee\n                                 must agree it’s the right fit for your child. Is this program a good fit for students with special needs? It depends on the child. Some students with special needs do well in this program,\n                                 especially those who need accommodations like a screen reader, larger text, or extended\n                                 time. However, this program is not a replacement for in-person services that some\n                                 students with special needs may require. What is an \"asynchronous\" online program? This means students complete lessons on their own time and pace, without live virtual\n                                 classes. It may not be suitable for all students, especially those who need more direct\n                                 teacher interaction. Is there an age limit for the program? Yes, students can participate up to age 25. Full-Time Tuition-Paid Program FAQ Who is eligible for the Full-Time Tuition-Paid Program? This program is open to all students, regardless of residency. It is ideal for: Non-Texas residents who wish to attend an accredited K-12 school. Students seeking flexibility due to personal, family or academic reasons. Homeschooled students who want the structure of an accredited online program. What courses are available in the Full-Time Tuition-Paid Program? Students have access to a wide range of courses, including: Core subjects (English, math, science, social studies) Electives (art, music, technology, etc.) Foreign languages (Spanish, French, etc.) Advanced Placement (AP) courses Credit recovery and acceleration options How is the Full-Time Tuition-Paid Program different from the state-funded, tuition-free\n                                 program? The Full-Time Tuition-Paid Program is for students who: Do not meet the eligibility criteria for the tuition-free program. Live outside of Texas. Choose a paid, flexible online learning experience. What is the tuition for the Full-Time Tuition-Paid Program? Tuition covers all course materials, textbooks and access to our online platform.\n                                 The program offers a competitive tuition rate. For specific details on tuition rates\n                                 and payment plans, please contact our admissions team. How do I enroll in the Full-Time Tuition-Paid Program? To enroll, follow these steps: Submit an Application: Complete the online application form and submit required documents (e.g., birth certificate\n                                    and previous transcripts, if applicable). Confirmation: Once your application is reviewed and accepted, you will receive confirmation of\n                                    your enrollment. Course Selection: Meet with an academic adviser to choose your courses based on your grade level, academic\n                                    goals and interests. Begin Learning: After enrollment, students can start their courses at any time and access all online\n                                    resources. Can my child earn a diploma through the Full-Time Tuition-Paid Program? Yes! Upon successful completion of the required coursework, students will receive\n                                 a Texas Tech K-12 diploma . The program also offers options for credit recovery and accelerated learning, helping\n                                 students meet their educational goals. What kind of support will my child receive in the Full-Time Tuition-Paid Program? Students in this program receive: Personalized Learning: Students can learn at their own pace, with flexibility to fit their schedules. Support from Certified Teachers: Our Texas-certified teachers provide guidance, feedback, and personalized support\n                                    throughout the academic year. Access to Advisors and Counselors: Academic advisers and counselors are available to help with course selection, academic\n                                    planning and career guidance. Technical Support: Our team is available to assist with any technology-related issues. What is the online learning environment like? The Full-Time Tuition-Paid Program offers a flexible, self-paced online learning environment where students complete coursework according to their individual schedules. Students\n                                 will not need to attend live classes at specific times. The program allows students\n                                 to progress at their own pace while receiving support from teachers and advisers. How long do students have to complete their courses? Each course is designed to be completed within one academic year, but students have\n                                 the flexibility to work ahead or take additional time as needed, depending on their\n                                 individual learning pace. Are there opportunities for accelerated learning or credit recovery? Yes, the Full-Time Tuition-Paid Program offers: Credit Recovery: Students who need to recover credits from previous courses can enroll in specific\n                                    courses to get back on track. Accelerated Learning: Students can take advanced or AP courses to accelerate their academic progress and\n                                    prepare for college or career goals. Can my child start at any time during the year? Yes! Enrollment is available year-round, and students can begin courses at any time.\n                                 The program's flexible schedule allows students to start when it's convenient for\n                                 them. How do I make tuition payments? Tuition payments can be made through a variety of payment plans. For details on payment\n                                 options, please contact our admissions team. What makes Texas Tech K-12 unique? Yes, the Full-Time Tuition-Paid Program offers: Affiliation with Texas Tech University: Students benefit from the prestige and academic rigor of Texas Tech, a Carnegie Tier-One\n                                    research institution. Accredited and Approved: We are accredited by Cognia and approved by the Texas Education Agency (TEA) , ensuring a high-quality, recognized education. Global Community: Our program serves students from across the United States and over 70 countries,\n                                    offering a diverse and inclusive learning environment. Adult Education FAQ Who is eligible for the TWC Adult Education Program? Texas residents aged 21 and older who have not completed high school. Adults who want to earn their high school diploma or prepare for the GED exam . The program is free and open to anyone who meets these basic eligibility requirements. What does the program offer? Free High School Classes: Complete your high school education with online courses at your own pace. Free GED Prep: Prepare for the GED exam with comprehensive online lessons and practice tests. Free Tutoring Services: Get personalized support to help you succeed. Free Career Training: Access career readiness workshops and resources to help you find a job or advance\n                                    in your career. Free College Readiness: Receive guidance and training to prepare for college or vocational education. Fully Online Learning: Learn from anywhere with an internet connection and work at your own pace. Is the program really free? Yes! This program is completely free for eligible participants. It is funded by the U.S. Department of Education and the Texas Workforce Commission (TWC) . How does the program work? Enrollment: Complete a simple online application to enroll in the program. Online Courses: Once enrolled, you can start your courses immediately. All materials and lessons\n                                    are available online. GED Testing Waivers: After completing the GED prep course, you will receive testing waivers, so you can\n                                    take the GED exam for little to no cost. Support Services: Receive tutoring, career training, and college readiness workshops throughout the\n                                    program. What do I need to get started? A computer or mobile device with internet access. Basic computer skills to navigate the online learning platform. Complete the online enrollment form or contact our team for more information. What happens after I complete the GED prep course? Once you finish the GED prep course , you'll receive GED testing waivers to help cover the cost of the GED exam . Our team will guide you through the testing process and help you schedule your GED\n                                    exam. Do I have to take a test before starting the program? You will need to complete some pre-testing to assess your current knowledge level and help determine which courses you’ll need.\n                                 These tests are designed to ensure you’re placed in the right program. Is there any assistance available if I need help during the program? Yes! You’ll have access to a variety of support services , including: Tutoring for one-on-one help with challenging subjects. Career training to help you improve your job prospects. College Readiness workshops if you plan to pursue higher education after completing the program. What are the benefits of earning a high school diploma or GED? Earning your diploma or GED can have a significant impact on your life, including: Better job opportunities: Many employers require a high school diploma or GED. Higher earning potential: On average, high school graduates and GED holders earn more than those without a\n                                    diploma. Access to higher education: Completing your diploma or GED opens doors to college or vocational training programs. Career advancement: If you're employed, earning your diploma or GED can help you qualify for promotions\n                                    and job advancement. How do I enroll in the program? To get started, follow these steps: Complete the online enrollment form or contact us to request more information. Pre-testing: Our team will help you schedule any necessary pre-tests for the GED prep or high\n                                    school diploma program. Start Learning: Once enrolled, you'll begin your online courses at your own pace. Request More Information TTU K-12 Like TTU K-12 on Facebook Like TTU K-12 on Facebook Subscribe to TTU K-12 on YouTube Subscribe to TTU K-12 on YouTube Follow TTU K-12 on Instagram Follow TTU K-12 on Instagram Address Texas Tech Plaza | 1901 University Ave, Lubbock, TX 79401 Phone (800) 692-6877 Email ttuk12@ttu.edu Texas Tech University 2500 Broadway Lubbock, Texas 79409 806.742.2011 Follow Texas Tech University Like Texas Tech University on Facebook Like Texas Tech University on Facebook Follow Texas Tech University on X (twitter) Follow Texas Tech University on X (twitter) Subscribe to Texas Tech University on YouTube Subscribe to Texas Tech University on YouTube Follow Texas Tech University on Instagram Follow Texas Tech University on Instagram Connect with Texas Tech University on LinkedIn Connect with Texas Tech University on LinkedIn Contact Us Campus Map Jobs @ TTU TechAlert General Policy Information Public Access to Course Info Energy Management Mental Health Resources Title IX Fraud and Misconduct Hotline Online Institutional Resumes Texas Transparency TTU System TTU Health Sciences Center TTUHSC El Paso Angelo State University Midwestern State University Statewide Search State of Texas Texas Homeland Security Texas Veterans Portal Texas CREWS SAO Fraud Reporting Open Records Requests © 2025            \t\t\t\t\t Texas Tech University Jan 31, 2025 8:27 AM TTU K-12 About TTU K-12 About Back About Us Meet Our Team Advisory Board FAQs Contact Us (Phone, Email) Programs TTU K-12 Programs Back K-12 Programs TTU K-12 Programs K-12 Programs Back Overview Tuition-Free Tuition-Paid Grade Levels (Elementary, Middle, High School) Supplemental Courses TTU K-12 Programs Supplemental Courses Back Single Course Enrollment Dual Credit Specialized Programs TTU K-12 Programs Specialized Programs Back Credit By Exams (CBEs) District Solutions TTU K-12 Programs District Solutions Back Solutions for Schools & Districts International Partnerships TTU K-12 Programs International Partnerships Back Texas Tech K-12 International Partnerships Adult Education TTU K-12 Programs Adult Education Back TWC  Adult Education Program Admissions TTU K-12 Admissions Back Enroll Tuition & Fees Course Catalog Student Resources TTU K-12 Student Resources Back Academic & Testing Resources TTU K-12 Student Resources Academic & Testing Resources Back Parent & Student Handbook Testing Resources Proctor Information Course Descriptions & Syllabi Student Support & Services TTU K-12 Student Resources Student Support & Services Back Military Support Disabilities Graduation & Financial Support TTU K-12 Student Resources Graduation & Financial Support Back Graduation & Scholarship Information Student Life & Engagement TTU K-12 Student Resources Student Life & Engagement Back Student Organizations Bookstore Experiential Learning TTU K-12 Student Resources Experiential Learning Back iOS Design Lab News & Updates TTU K-12 News & Updates Back Newsletter & Stories Contact Focus Login Additional Resources TTU Home Directory Raiderlink A-Z Index"}
